;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; Chinese input
(package! fcitx)

;; UI
(package! spacious-padding)

;; Notes / Zettelkasten
(package! denote)
(package! denote-org)
(package! denote-sequence)
(package! denote-explore)
(package! consult-notes)

;; Reading
(package! nov)

;; GC
(package! gcmh)

;; Writing
(package! super-save)

;; Chinese-aware navigation & completion
(package! ace-pinyin)
(package! evil-pinyin)

;; Profiling
(package! benchmark-init)
